<h1>Nombres de bebé de united states desde 1880</h1>

La <acronym title="United States Social Security Administration">SSA</acronym> tiene datos sobre la frecuencia de los nombres de bebé desde 1880 hasta el presente.

Nota: La información está dividida en ficheros por año (se encuentran en la carpeta 'data').

In [3]:
# Importaciones
import pandas as pd

names1880 = pd.read_csv('data/yob1880.txt', names=['name', 'sex', 'births'])

In [14]:
names1880[:10]

        name sex  births
0       Mary   F    7065
1       Anna   F    2604
2       Emma   F    2003
3  Elizabeth   F    1939
4     Minnie   F    1746
5   Margaret   F    1578
6        Ida   F    1472
7      Alice   F    1414
8     Bertha   F    1320
9      Sarah   F    1288

Podemos calcular el total de cumpleaños agrupado por sexo:

In [16]:
names1880.groupby('sex').births.sum()

sex
F     90993
M    110493
Name: births, dtype: int64

Vamos a agrupar todos los ficheros (yob1880,yob1881, etc) y además añadiremos el campo year (año) para saber de que año es cada persona.

In [20]:
years = range(1880, 2011)

pieces = []
columns = ['name', 'sex', 'births']

for year in years:
    path = 'data/yob%d.txt' % year
    frame = pd.read_csv(path, names=columns)
    
    # Añadimos la columna year
    frame['year'] = year
    pieces.append(frame)
    
names = pd.concat(pieces, ignore_index=True)

In [19]:
names[:10]

        name sex  births  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880
5   Margaret   F    1578  1880
6        Ida   F    1472  1880
7      Alice   F    1414  1880
8     Bertha   F    1320  1880
9      Sarah   F    1288  1880

Ahora calcularemos la suma de cumpleaños según el sexo y por año:

In [22]:
total_births = names.pivot_table('births', index='year', columns='sex', aggfunc=sum)
total_births.head()

sex        F       M
year
1880   90993  110493
1881   91955  100748
1882  107851  113687
1883  112322  104632
1884  129021  114445